/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_ft.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yjung <yjung@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/19 01:55:39 by yjung             #+#    #+#             */
/*   Updated: 2020/10/24 22:21:51 by yjung            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdarg.h>
#include <stdio.h>

int		main(void)
{
//	int a = 15;
	printf("%.5-10d", 12);
	return (0);
}

// 정수에 precision 붙으면 남은 칸 모두 0으로? (%.10d, %10d)
// 문자열에는 precision 적용 안되는듯
// 문자열에는 width 와 [-] flag만 적용
// "%-10.5d",  -123 -> -00123
